content/teaching/2022_mathematical_writing/index.org
# Created 2023-01-31 Tue 14:06
#+title: The language of mathematics, 2022 Semester 1
#+author: Anand Deopurkar
The aim of this course is to develop written and oral communication skills in mathematics.
Through weekly readings, discussions, and presentations we will learn
- how to write mathematics clearly and coherently,
- how to use symbols and equations within mathematical text,
- how to structure and present arguments,
- how to organise long mathematical documents,
- how to present ideas clearly and effectively.

* Structure of the course
We will meet twice a week, on Tuesday from 12 to 1:30 and Thursday from 2 to 3:30.
One meeting will be devoted to writing and one to oral presentation.
In the meeting about writing, we will review the week's reading, do in-class exercises, and discuss the writing assignment.
In the meeting about presentation, one or two students will give short talks, and we will discuss various aspects of presentation raised by the talks.

1. Tuesdays 12 to 1:30, MSI Board Room (HN 2.48) - presentation
2. Thursdays 2 to 3:30, MSI Board Room (HN 2.48) - writing

* Assessment
The mark will be based on class participation (10%), writing assignments (60%), and in-class presentations (30%).  

* Resources
- Francesco Vivaldi, /Mathematical Writing for Undergraduate Students/ (Required textbook)
- Primer, University of Michigan, /Demonstration, Proof beyond the possibility of doubt/ ([[http://www.math.lsa.umich.edu/~smdbackr/MATH/Mathematical_Writing_A_Primer.pdf][Online textbook]])

* Rough plan for the writing component
1. Weeks 1-3 : Fundamentals
2. Weeks 4-6 : Writing proofs
3. Weeks 7-9 : Micro writing (small-scale issues)
4. Weeks 10-12 : Macro writing (large-scale issues)

* Collaboration and late policy
You may collaborate with others, but *everything you submit must be your own work*.  That is, you must write your own submissions, and not copy it from anywhere else.  If you get any outside help, you *must acknowledge it* by writing (for example) "I worked with ... and ... for this homework."  Or "I took help from ... website for this homework".  Failing to do this is a form of academic dishonesty.

Late homework will be penalised at 10\% of the grade per day, for a maximum of 3 days, after which it will receive a score of 0.  The exception is if you ask me for an extension *in writing* (email is fine) at least *24 hours before* the deadline.

* Detailed weekly plan
:PROPERTIES:
:EXPORT_TITLE: ""
:EXPORT_OPTIONS: toc:nil
:END:
The writing assignments are due on Mondays by 5pm.
I expect you to be familiar with the reading by the class on Thursday.
** Week 12
*** Reading and discussion
- Igor Pak,  [[https://www.math.ucla.edu/~pak/papers/how-to-write1.pdf][How to write a clear math paper]]
*** Writing
- Submit a revised draft of your final paper.
- Submit the final draft of your final paper (at the end of the exam period).
*** Presentations
**** Continued fractions
***** Kristian                                                     :noexport:
- Good amount of text on the slides.
- Very clear slides.
- Good motivation (approximation of pi).
- Good: standing in front of the slides, facing the audience.
- Use \mathbb R or \mathbf R for real numbers.
- Check spelling/grammar.
- Very good examples.
**** The wave equation
***** Tongjia                                                      :noexport:
- Give motivation before diving into mathematics.
  For example, explaining why the wave equation is called the "wave equation" is probably good motivation.
- Can you draw pictures? Video?
- Carefully choose which details to present.  You could have skipped the physics behind the derivation of the wave equation.
- Face the audience, not the screen.
- What do the initial conditions mean?  Does it have a physical interpretation?
- Simplify!
*** Notes on Pak                                                   :noexport:
:PROPERTIES:
:EXPORT_OPTIONS: toc:nil ':t author:nil date:nil
:EXPORT_FILE_NAME: pak-notes.pdf
:EXPORT_LATEX_HEADER_EXTRA: \usepackage{fullpage}
:EXPORT_LATEX_CLASS: amsart
:END:
**** Be clear!
- Takes time and a lot of effort.
- If you do not take the time to be clear:
  - you lose readers,
  - you lose a chance to make an impact,
  - people do not take you seriously,
  - you disadvantage yourself.
- Ignore the rules when they make the math unclear.
**** Where to start
- Good guide on writing nonfiction.
**** Macro tips
***** Title
- Super important
- Try different versions on your colleagues
- First approximation to the contents of your paper
***** Abstract
- Easiest section to write.
- Nothing personal, just dry facts.
- Rule of thumb: 0.3-0.5 times the number of pages.
***** Introduction
- This is the hardest section to write.
- Main theorem on the first page, or at most the second page.
- In the last paragraph, outline the structure of the paper in your own words.
**** Micro tips
- Basic grammar, syntax, punctuation
- Don't be pedantic
- Downshift your style:
  - Write short sentences
  - Use commas for pauses
**** Rewrite




** Week 11
*** Reading and discussion
- Paul Halmos, [[file:Halmos.pdf][How to write mathematics]]
*** Writing
- Submit a first draft of your final paper.
*** Presentations
**** Central limit theorem
***** Zihan                                                        :noexport:
- Do not make the readers read the slides.  Talk!
- Too much text on the slides.
- Explain the pictures/graph.
- Choose consistent notation.
**** RSA crypotgraphy
***** Chuqiao Xu, RSA                                              :noexport:
- Good outline
- Good diagrams
- Explain everything on the diagrams.  In you case, you did not explain anything about keys.
- Excellent organisation of the slides.  I liked that you copied the important information from the last slides.
- Choose consistent notation.  In your case, c was used for the cipher text, and you changed it to the message "c" on the next slide.
**** Primality testing
***** Fengyawen Li, Primality testing                              :noexport:
- Good amount of text on the slides
- Good organisation
- Nice attractive slides
- Good pace
- Very good examples.
*** Notes on Berndt                                                :noexport:
:PROPERTIES:
:EXPORT_OPTIONS: toc:nil ':t author:nil date:nil
:EXPORT_FILE_NAME: berndt-notes.pdf
:END:
1. *The title* should be informative.

2. *The introduction* is the most important part of the paper.

   - Get to the purpose of your paper as soon as possible.

3. *Mathematical formulas*

   - Display complicated expressions and equations.
   - Do not use abbreviations.

4. *Language*

   - Be precise.  Sloppy descriptions are not acceptable.
   - Everything must be written in sentences.
   - Never begin a sentence with a symbol.
   - Pay attention to dangling participles.
   - Omit filler phrases like "We have".
   - Do not use "get".
   - Use direct verbs.

5. *Citations*
   - Give page numbers.
   - Give references to all results that you quote, except well-known theorems.

6. *List of references*
   - Be consistent.

** Week 10
*** Reading and discussion
- Bruce Berndt, [[file:writingmath.pdf][How to write mathematical papers]]
*** Writing
- Sumit a tentative title and outline of your final paper.
*** Presentations
**** The RSA cryptosystem
***** Zhining Wang, The RSA Cryptosystem                           :noexport:
- Spend more time on the slides
- Too much text on some slides
- Good examples with the factorisation
- What do you achieve by slide/board hybrid?

**** Ordinary differential equations
***** Han Lin, odes                                                :noexport:
- Too much text on the slides
- approx. 20 slides for 10-15 minute talk is too many slides.
- only include the important proofs.
- do not spend time doing calculations, or reading calculations
- You do not have to read everything on the slides.
- Good summary

**** Jingning Yao                                                  :noexport:
- Good idea to give the menu
- Do not have to include all the proofs
- Motivation?  What problem are you trying to solve?
- If there is an "obvious" solution or idea to your problem, discuss it.
- What did you achieve by a board/slide combo?

