teaching/2022_mathematical_writing/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-16 Tue 11:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The language of mathematics, 2022 Semester 1</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">The language of mathematics, 2022 Semester 1</h1>
<div class="properties" id="orga045337">

</div>

<p>
The aim of this course is to develop written and oral communication skills in mathematics.
Through weekly readings, discussions, and presentations we will learn
</p>
<ul class="org-ul">
<li>how to write mathematics clearly and coherently,</li>
<li>how to use symbols and equations within mathematical text,</li>
<li>how to structure and present arguments,</li>
<li>how to organise long mathematical documents,</li>
<li>how to present ideas clearly and effectively.</li>
</ul>
<div id="outline-container-orgf69887c" class="outline-2">
<h2 id="orgf69887c">Structure of the course</h2>
<div class="outline-text-2" id="text-orgf69887c">
<p>
We will meet twice a week, on Tuesday from 12 to 1:30 and Thursday from 2 to 3:30.
One meeting will be devoted to writing and one to oral presentation.
In the meeting about writing, we will review the week&rsquo;s reading, do in-class exercises, and discuss the writing assignment.
In the meeting about presentation, one or two students will give short talks, and we will discuss various aspects of presentation raised by the talks.
</p>

<ol class="org-ol">
<li>Tuesdays 12 to 1:30, MSI Board Room (HN 2.48) - presentation</li>
<li>Thursdays 2 to 3:30, MSI Board Room (HN 2.48) - writing</li>
</ol>
</div>
</div>
<div id="outline-container-org3cb74fb" class="outline-2">
<h2 id="org3cb74fb">Assessment</h2>
<div class="outline-text-2" id="text-org3cb74fb">
<p>
The mark will be based on class participation (10%), writing assignments (60%), and in-class presentations (30%).  
</p>
</div>
</div>
<div id="outline-container-org1670f0a" class="outline-2">
<h2 id="org1670f0a">Resources</h2>
<div class="outline-text-2" id="text-org1670f0a">
<ul class="org-ul">
<li>Francesco Vivaldi, <i>Mathematical Writing for Undergraduate Students</i> (Required textbook)</li>
<li>Primer, University of Michigan, <i>Demonstration, Proof beyond the possibility of doubt</i> (<a href="Mathematical_Writing_A_Primer.pdf">Online textbook</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-orgcd8047b" class="outline-2">
<h2 id="orgcd8047b">Rough plan for the writing component</h2>
<div class="outline-text-2" id="text-orgcd8047b">
<ol class="org-ol">
<li>Weeks 1-3 : Fundamentals</li>
<li>Weeks 4-6 : Writing proofs</li>
<li>Weeks 7-9 : Micro writing (small-scale issues)</li>
<li>Weeks 10-12 : Macro writing (large-scale issues)</li>
</ol>
</div>
</div>
<div id="outline-container-org5b3c7d3" class="outline-2">
<h2 id="org5b3c7d3">Collaboration and late policy</h2>
<div class="outline-text-2" id="text-org5b3c7d3">
<p>
You may collaborate with others, but <b>everything you submit must be your own work</b>.  That is, you must write your own submissions, and not copy it from anywhere else.  If you get any outside help, you <b>must acknowledge it</b> by writing (for example) &ldquo;I worked with &#x2026; and &#x2026; for this homework.&rdquo;  Or &ldquo;I took help from &#x2026; website for this homework&rdquo;.  Failing to do this is a form of academic dishonesty.
</p>

<p>
Late homework will be penalised at 10\% of the grade per day, for a maximum of 3 days, after which it will receive a score of 0.  The exception is if you ask me for an extension <b>in writing</b> (email is fine) at least <b>24 hours before</b> the deadline.
</p>
</div>
</div>
<div id="outline-container-org1d0678f" class="outline-2">
<h2 id="org1d0678f">Detailed weekly plan</h2>
<div class="outline-text-2" id="text-org1d0678f">
<div class="properties" id="org6dc2fef">

</div>

<p>
The writing assignments are due on Mondays by 5pm.
I expect you to be familiar with the reading by the class on Thursday.
</p>
</div>
<div id="outline-container-org341c39e" class="outline-3">
<h3 id="org341c39e">Week 12</h3>
<div class="outline-text-3" id="text-org341c39e">
</div>
<div id="outline-container-orgf0ad55e" class="outline-4">
<h4 id="orgf0ad55e">Reading and discussion</h4>
<div class="outline-text-4" id="text-orgf0ad55e">
<ul class="org-ul">
<li>Igor Pak,  <a href="https://www.math.ucla.edu/~pak/papers/how-to-write1.pdf">How to write a clear math paper</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2866568" class="outline-4">
<h4 id="org2866568">Writing</h4>
<div class="outline-text-4" id="text-org2866568">
<ul class="org-ul">
<li>Submit a revised draft of your final paper.</li>
<li>Submit the final draft of your final paper (at the end of the exam period).</li>
</ul>
</div>
</div>
<div id="outline-container-org2a3c445" class="outline-4">
<h4 id="org2a3c445">Presentations</h4>
<div class="outline-text-4" id="text-org2a3c445">
</div>
<ul class="org-ul">
<li><a id="org8161768"></a>Continued fractions<br /></li>
<li><a id="org25dd7c7"></a>The wave equation<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge8b73ad" class="outline-3">
<h3 id="orge8b73ad">Week 11</h3>
<div class="outline-text-3" id="text-orge8b73ad">
</div>
<div id="outline-container-org4019e73" class="outline-4">
<h4 id="org4019e73">Reading and discussion</h4>
<div class="outline-text-4" id="text-org4019e73">
<ul class="org-ul">
<li>Paul Halmos, <a href="Halmos.pdf">How to write mathematics</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf60e93e" class="outline-4">
<h4 id="orgf60e93e">Writing</h4>
<div class="outline-text-4" id="text-orgf60e93e">
<ul class="org-ul">
<li>Submit a first draft of your final paper.</li>
</ul>
</div>
</div>
<div id="outline-container-orgca07905" class="outline-4">
<h4 id="orgca07905">Presentations</h4>
<div class="outline-text-4" id="text-orgca07905">
</div>
<ul class="org-ul">
<li><a id="org0143d2d"></a>Central limit theorem<br /></li>
<li><a id="org1ea8352"></a>RSA crypotgraphy<br /></li>
<li><a id="orgce97013"></a>Primality testing<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org48aafb8" class="outline-3">
<h3 id="org48aafb8">Week 10</h3>
<div class="outline-text-3" id="text-org48aafb8">
</div>
<div id="outline-container-org728546b" class="outline-4">
<h4 id="org728546b">Reading and discussion</h4>
<div class="outline-text-4" id="text-org728546b">
<ul class="org-ul">
<li>Bruce Berndt, <a href="writingmath.pdf">How to write mathematical papers</a></li>
</ul>
</div>
</div>
<div id="outline-container-org51741b2" class="outline-4">
<h4 id="org51741b2">Writing</h4>
<div class="outline-text-4" id="text-org51741b2">
<ul class="org-ul">
<li>Sumit a tentative title and outline of your final paper.</li>
</ul>
</div>
</div>
<div id="outline-container-orgea7cc68" class="outline-4">
<h4 id="orgea7cc68">Presentations</h4>
<div class="outline-text-4" id="text-orgea7cc68">
</div>
<ul class="org-ul">
<li><a id="org0fa53ef"></a>The RSA cryptosystem<br /></li>
<li><a id="orgbca7290"></a>Ordinary differential equations<br /></li>
</ul>
</div>
</div>
