content/teaching/2022_mathematical_writing/index.org
*** Notes on Halmos                                                :noexport:
:PROPERTIES:
:EXPORT_OPTIONS: toc:nil ':t author:nil date:nil
:EXPORT_LATEX_HEADER_EXTRA: \usepackage{fullpage}
:END:
1. *Say something*
   - Two ways in which writing can be bad: no ideas or too many.

2. *Speak to someone*
   - Keep a particular reader in mind.

3. *Organize first*
   - Make an outline
   - An outline in which every discussion, lemma, theorem, corollary, remark, and proof are mentioned.  And these appear in an order that is logically correct and psychologically digestible.

4. *Think about the alphabet*
   - Good notation.
     For example, either \(ax+by\) or \(a_1x_1+a_2x_{2}\) is preferable to \(ax_1+bx_2\).

5. *Write in spirals*
   - 1; 2, 1, 2; 3, 1, 2, 3; 4, 1, 2, 3, 4 ...
   - While revising, do not edit but rewrite.

6. *Organize always*

7. *Write good english*
   - Write in currently and commonly accepted style.

8. *Honesty is the best policy*
   - If you are using a theorem without proof, say so.
   - If you are using a mathematical concept without defining it, say so.
   - Do not hide the status of your statements.  
     Whenever you tell the reader something, tell where it stands: this has been proved, this hasn't, this will be proved, that won't.

9. *Down with the irrelevant and the trivial*
   - Don't ramble on and then suddenly announce "Thus we have proved that ..."  State the result first, and then prove it.
   - Leave chit-chat out of the statement of the theorem.

10. *Do and do not repeat*

11. *The editorial We is not all bad*

12. *Use words correctly*
    - Correct quantifiers.  Avoid 'any'; use 'each' or 'every'.
    - Write 'if', 'then', 'for all', 'there exist' rather than logical symbols.

13. *Use technical terms correctly*

14. *Resist symbols*

15. *Use symbols correctly*


** Week 9
*** Reading and discussion
- Kleiman, [[file:kleiman.pdf][Writing a phase two math paper]]
*** Writing
- Submit the final draft of your first paper.

- The final writing assignment.

  Your goal is to write a 5-10 page paper about the topic of your second talk.
  It should have a title, an abstract, a section called "Introduction", other sections, and a bibliography.
  There must be more than one mathematical results with proofs.
  The mark will only be based on the final submission, but there are the intermediate submissions before the final one.

  1. In week 10, a tentative title and an outline of the paper.
  2. In week 11, a first draft
  3. In week 12, a revised draft
  4. In the exam period, the final draft.

*** Presentation
**** Taylor Series
***** Buda Wu, Taylor Series                                       :noexport:
- Good examples
- Good clean slides
  - The first slide had too much text
- Excellent use of software
- Missing: motivation
- Prepare all the technology in advance
- Excellent use of pictures
- Describe what you are doing before you do it, especially if it is something complicated.
**** Fermat's Little Theorem
***** Weihua, Fermat's Little Theorem                              :noexport:
- Reduce text on slides.  Shorten as much as possible.
- Good examples
- Missing: motivation.  Why should the readers care?
**** The binomial distribution
***** Yi Zhuang, Binomial distribution                             :noexport:
- Good amount of text on the slides.
- Excellent pictures
- Include: motivation

**** The Poisson distribution
***** Xiaoxuan, The Poisson distribution                           :noexport:
- Good graphs
- Missing motivation at the beginning
- Good examples!
- Good amount of text, but you can be even more succinct.
- Proof (of what?)
- You don't have to read everything on the slide.

** Week 8
*** Reading and discussion
- Watch Jean-Pierre Serre's [[https://youtu.be/ECQyFzzBHlo][How to write mathematics badly]].
*** Writing
- A first draft of your first paper.
*** Presentation
- No presentations this week
** Week 7
*** Reading and discussion
1. Keith Conrad, [[file:keithconradwriting.pdf][Advice on mathematical writing]]

*** Writing
This is a longer writing assignment.
The first draft is due in Week 8, and a revised draft is due in Week 9.  Your mark will be based only on the revised draft.

Write a 1 to 2 page paper about the content of your first talk.
Include a title and one or two short introductory paragraphs.
Your write-up must contain at least one definition, one example, and one result with proof.
See "6. Types of Mathematical Results" and "7. Definitions" in Keith Conrad's document.
For this assignment, you do not have to include references, and it is OK to not divide your document into sections.

*** Presentations
**** Explain the intermediate value theorem.
***** Zihan                                                        :noexport:

1. Good pictures.
2. I could not understand the motivation.
3. Good, clear handwriting.
4. Clear statement of the theorem (both versions).
5. The later (third) picture was hard to follow.
6. The proof was hard to follow.
7. You went over time.

**** Discuss the determinant of a matrix.
***** Chuqiao                                                      :noexport:

1. If you say something is "important" or "interesting", say why.
2. Talk as you write.  Speak more than what you write.  (You did this later, which was good!)
3. Good for alerting that the notation for |A| is not the absolute value.
4. Your definition did not actually define the determinant, which was confusing.
5. Good examples.
6. Clear outline.
7. It would have been nice to emphasize the signs.

**** Explain the fundamental theorem of algebra.
***** Tongjia                                                      :noexport:

1. Be careful about your notation.  Is C algebraically closed or C[x]?
2. Write a theorem as a "Theorem: ...."
3. If you begin a proof, write "Proof:"
4. Check your examples: is 1/z really an entire function?  What is the domain?
5. If the proof is by contradiction, say that at the beginning of the proof.
6. Be neater in our boardwork.  If you erase something, erase it completely.

** Week 6
*** Reading and discussion
1. Primer, Proof techniques: Proof by induction
2. Vivaldi, Chapter 8
3. [[file:worksheet06.pdf][In class exercise 6]]

*** Writing
1. Revise and resubmit one proof from assignment 4.
   Schedule a meeting to talk about the revision.
*** Presentations
**** Convince us that \ (\sqrt 2\) is irrational.
***** Adam                                                         :noexport:
- Excellent font size for the title!
- Speak more loudly.
- Speak while writing.  Avoid long silences.
- Good effort to explain the significance of the result!  Historical significance can be a great motivation.  But you could have done a better job at explaining the history.
- State the result before turning to the proof.
- Good organisation (lemma/theorem).
- Keep the notation straight.

**** Explain the binomial coefficients \(n \choose r\).
***** Lucy                                                         :noexport:

- Good clear speaking.
- Write more neatly.
- Good example!
- It can be confusing to give two definitions of the same concept, especially if it is not obvious why they are equivalent.
- If you are using a theorem, state that you are using .... theorem.
- Give more guidelines in the talk: what you are doing, where are you going next, etc.

** Week 5
*** Reading and discussion
1. Primer, Proof techniques: Contraposition, Contradiction
2. Vivaldi, Chapter 7
3. [[file:worksheet05.pdf][In class exercise 5]]
*** Writing
:PROPERTIES:
:EXPORT_FILE_NAME: writing05.pdf
:EXPORT_TITLE: Writing Assignment 5
:EXPORT_AUTHOR: MATH8705 The Language of Mathematics 2022
:EXPORT_OPTIONS: toc:nil ':t
:export_latex_header_extra: \input{macros}
:EXPORT_DATE: 
:END:
1. Vivaldi, Chapter 7, Exercise 7.2
2. Vivaldi, Chapter 7, Exercise 7.3
3. Vivaldi, Chapter 7, Exercise 7.4 (5 more)



*** Presentations
**** Explain eigenvalues and eigenvectors.
***** Jingning                                                     :noexport:
- Write coherently on the board.
- Do not clutter the board.
- Draw a picture if possible.
- Write a clear definition: what is being defined?  What kind of object is it?  What are the defining properties?  Pay attention to the quantifiers.
- Illustrate the definition with examples.
- Tell the audience what you are doing and why you are doing it.  Provide guides.
- Write down the important points on the board, not just the calculation.

**** Explain unique factorisation of integers.
***** Xiaoxuan                                                     :noexport:
- Good loud voice and nice handwriting.
- Speak while you write.  Speak more than you write.
- The statement you wrote did not mention uniqueness.
- Write the main steps in the proof on the board.
- In the proof, why do the a and b have only two prime factors?
- Avoid stating/proving a theorem inside the proof of another theorem.
- Explain the notation in the proof.  What is A? What is B? What is p?  What is A*?  What is B*?

** Week 4
