teaching/2022_mathematical_writing/index.html
<div id="outline-container-org992cecb" class="outline-3">
<h3 id="org992cecb">Week 9</h3>
<div class="outline-text-3" id="text-org992cecb">
</div>
<div id="outline-container-org63b5e3a" class="outline-4">
<h4 id="org63b5e3a">Reading and discussion</h4>
<div class="outline-text-4" id="text-org63b5e3a">
<ul class="org-ul">
<li>Kleiman, <a href="kleiman.pdf">Writing a phase two math paper</a></li>
</ul>
</div>
</div>
<div id="outline-container-org82560bd" class="outline-4">
<h4 id="org82560bd">Writing</h4>
<div class="outline-text-4" id="text-org82560bd">
<ul class="org-ul">
<li>Submit the final draft of your first paper.</li>

<li><p>
The final writing assignment.
</p>

<p>
Your goal is to write a 5-10 page paper about the topic of your second talk.
It should have a title, an abstract, a section called &ldquo;Introduction&rdquo;, other sections, and a bibliography.
There must be more than one mathematical results with proofs.
The mark will only be based on the final submission, but there are the intermediate submissions before the final one.
</p>

<ol class="org-ol">
<li>In week 10, a tentative title and an outline of the paper.</li>
<li>In week 11, a first draft</li>
<li>In week 12, a revised draft</li>
<li>In the exam period, the final draft.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3d3beb" class="outline-4">
<h4 id="orgf3d3beb">Presentation</h4>
<div class="outline-text-4" id="text-orgf3d3beb">
</div>
<ul class="org-ul">
<li><a id="org9124b44"></a>Taylor Series<br /></li>
<li><a id="orgcdcb40a"></a>Fermat&rsquo;s Little Theorem<br /></li>
<li><a id="orga7e45a1"></a>The binomial distribution<br /></li>
<li><a id="org4e890a4"></a>The Poisson distribution<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgfe27bcd" class="outline-3">
<h3 id="orgfe27bcd">Week 8</h3>
<div class="outline-text-3" id="text-orgfe27bcd">
</div>
<div id="outline-container-orgbe19f84" class="outline-4">
<h4 id="orgbe19f84">Reading and discussion</h4>
<div class="outline-text-4" id="text-orgbe19f84">
<ul class="org-ul">
<li>Watch Jean-Pierre Serre&rsquo;s <a href="https://youtu.be/ECQyFzzBHlo">How to write mathematics badly</a>.</li>
</ul>
</div>
</div>
<div id="outline-container-org79ef5d3" class="outline-4">
<h4 id="org79ef5d3">Writing</h4>
<div class="outline-text-4" id="text-org79ef5d3">
<ul class="org-ul">
<li>A first draft of your first paper.</li>
</ul>
</div>
</div>
<div id="outline-container-org1cd8178" class="outline-4">
<h4 id="org1cd8178">Presentation</h4>
<div class="outline-text-4" id="text-org1cd8178">
<ul class="org-ul">
<li>No presentations this week</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1df1145" class="outline-3">
<h3 id="org1df1145">Week 7</h3>
<div class="outline-text-3" id="text-org1df1145">
</div>
<div id="outline-container-org29ce3b9" class="outline-4">
<h4 id="org29ce3b9">Reading and discussion</h4>
<div class="outline-text-4" id="text-org29ce3b9">
<ol class="org-ol">
<li>Keith Conrad, <a href="keithconradwriting.pdf">Advice on mathematical writing</a></li>
</ol>
</div>
</div>
<div id="outline-container-org29d43ba" class="outline-4">
<h4 id="org29d43ba">Writing</h4>
<div class="outline-text-4" id="text-org29d43ba">
<p>
This is a longer writing assignment.
The first draft is due in Week 8, and a revised draft is due in Week 9.  Your mark will be based only on the revised draft.
</p>

<p>
Write a 1 to 2 page paper about the content of your first talk.
Include a title and one or two short introductory paragraphs.
Your write-up must contain at least one definition, one example, and one result with proof.
See &ldquo;6. Types of Mathematical Results&rdquo; and &ldquo;7. Definitions&rdquo; in Keith Conrad&rsquo;s document.
For this assignment, you do not have to include references, and it is OK to not divide your document into sections.
</p>
</div>
</div>
<div id="outline-container-orga7edb0a" class="outline-4">
<h4 id="orga7edb0a">Presentations</h4>
<div class="outline-text-4" id="text-orga7edb0a">
</div>
<ul class="org-ul">
<li><a id="orgf6fe5b6"></a>Explain the intermediate value theorem.<br /></li>
<li><a id="org42b4e35"></a>Discuss the determinant of a matrix.<br /></li>
<li><a id="org903d78f"></a>Explain the fundamental theorem of algebra.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga56acb7" class="outline-3">
<h3 id="orga56acb7">Week 6</h3>
<div class="outline-text-3" id="text-orga56acb7">
</div>
<div id="outline-container-orgc5fa8e2" class="outline-4">
<h4 id="orgc5fa8e2">Reading and discussion</h4>
<div class="outline-text-4" id="text-orgc5fa8e2">
<ol class="org-ol">
<li>Primer, Proof techniques: Proof by induction</li>
<li>Vivaldi, Chapter 8</li>
<li><a href="worksheet06.pdf">In class exercise 6</a></li>
</ol>
</div>
</div>
<div id="outline-container-org0aae805" class="outline-4">
<h4 id="org0aae805">Writing</h4>
<div class="outline-text-4" id="text-org0aae805">
<ol class="org-ol">
<li>Revise and resubmit one proof from assignment 4.
Schedule a meeting to talk about the revision.</li>
</ol>
</div>
</div>
<div id="outline-container-org110e5c4" class="outline-4">
<h4 id="org110e5c4">Presentations</h4>
<div class="outline-text-4" id="text-org110e5c4">
</div>
<ul class="org-ul">
<li><a id="org4e008cc"></a>Convince us that \ (\sqrt 2\) is irrational.<br /></li>
<li><a id="org8218b86"></a>Explain the binomial coefficients \(n \choose r\).<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8bb2569" class="outline-3">
<h3 id="org8bb2569">Week 5</h3>
<div class="outline-text-3" id="text-org8bb2569">
</div>
<div id="outline-container-orgbcf86f8" class="outline-4">
<h4 id="orgbcf86f8">Reading and discussion</h4>
<div class="outline-text-4" id="text-orgbcf86f8">
<ol class="org-ol">
<li>Primer, Proof techniques: Contraposition, Contradiction</li>
<li>Vivaldi, Chapter 7</li>
<li><a href="worksheet05.pdf">In class exercise 5</a></li>
</ol>
</div>
</div>
<div id="outline-container-org4b7cb64" class="outline-4">
<h4 id="org4b7cb64">Writing</h4>
<div class="outline-text-4" id="text-org4b7cb64">
<div class="properties" id="orgb3fbbbc">

</div>

<ol class="org-ol">
<li>Vivaldi, Chapter 7, Exercise 7.2</li>
<li>Vivaldi, Chapter 7, Exercise 7.3</li>
<li>Vivaldi, Chapter 7, Exercise 7.4 (5 more)</li>
</ol>
</div>
</div>
<div id="outline-container-org667e35b" class="outline-4">
<h4 id="org667e35b">Presentations</h4>
<div class="outline-text-4" id="text-org667e35b">
</div>
<ul class="org-ul">
<li><a id="org05fee4e"></a>Explain eigenvalues and eigenvectors.<br /></li>
<li><a id="orgb8e15aa"></a>Explain unique factorisation of integers.<br /></li>
</ul>
</div>
</div>
