content/teaching/2022_mathematical_writing/index.org
*** Reading and discussion
1. Primer, Proof Techniques: Uniqueness, Casework, Either/Or Max/Min
2. Vivaldi, Chapter 6
3. Vivaldi, Sections 7.7, 7.8
4. [[file:worksheet04.pdf][In class exercise 4]]
*** Writing
:PROPERTIES:
:EXPORT_FILE_NAME: writing04.pdf
:EXPORT_TITLE: Writing Assignment 4
:EXPORT_AUTHOR: MATH8705 The Language of Mathematics 2022
:EXPORT_OPTIONS: toc:nil ':t
:export_latex_header_extra: \input{macros}
:EXPORT_DATE: 
:END:
1. Vivaldi, Chapter 7, Exercise 7.1 (any 2)
2. Vivaldi, Chapter 7, Exercise 7.4 (any 5)

*** Presentation
**** Define the limit of a sequence.
***** Zhining                                                      :noexport:

- Good informal beginning
- Humour!
- Good example.
- Good: stressing the different parts of the definition.
- Describe the notation in an example.
- Draw a picture if possible.
- Write the definition clearly.
- Explain the definition with an example, especially if it is a complicated definition.
- Looked at the audience.  Clear and loud voice.
- Keep the talk focused.

**** Explain the quadratic formula.
***** Han                                                          :noexport:

- Good that you connected to a previous talk.
- Good that you gave an example, but the example was very special!
- Motivate! Explain in the beginning what you are going to do.  Why should the listeners keep listening to your talk?
- Look at the audience.  Do not talk to the board.  It was very hard for half the room to read what you were writing on the board.
- Avoid long silences.
- Simplify:
  Strategies:
  - Explain the easier cases.
  - Make assumptions that simplify the situation.


** Week 3
*** Reading and discussion
1. Primer, Functions (part two), negating universal quantifiers, negating existential quantifiers, negating nested quantifiers
2. Vivaldi, Chapter 4
3. Vivaldi, Chapter 5
4. [[file:worksheet03.pdf][In class exercise 3]]
*** Writing
:PROPERTIES:
:EXPORT_FILE_NAME: writing03.pdf
:EXPORT_TITLE: Writing Assignment 3
:EXPORT_AUTHOR: MATH8705 The Language of Mathematics 2022
:EXPORT_OPTIONS: toc:nil ':t
:export_latex_header_extra: \input{macros}
:EXPORT_DATE: 
:END:
1. Vivaldi, Chapter 4, Exercise 4.3 (any 10)
2. Vivaldi, Chapter 4, Exercise 4.4 (Only state the negations for any 5)
3. Vivaldi, Chapter 5, Exercise 5.1
*** Presentation
**** Define a polynomial function and give some examples.
***** Yi Zhuang                                                    :noexport:

- Write a title
- Speak, don't just write.
- What are the a_i ?
- Is n = 0 allowed?
- Use consistent notation, or make a comment if you change notation.
- It's good that you explained the notation in an example.
- Good range of examples: negative, fractional coefficients, non-standard form.
- Treat edge cases.

**** Define similar triangles.  Define equilateral triangles.  Prove that any two equilateral triangles are similar.
***** Kristian Zhamy Octavianus)                                   :noexport:

- Wrote the title. Good.
- Good beginning with informal introduction.
- Nice big handwriting and pictures.  Clear boardwork!
- Unclear definition.
- Repeated "same shape" and "lookalike" many times, but did not give the actual definition.
- Definition was in terms of the sides, but the explanation also involved angles.
- What does "similar in the ratio" mean?
- Pictures on the board unclear.
- Good that you gave multiple ways, but how do they relate to the definition?
- A/B = D/E = C/D is confusing.  Are these angles or sides?
- Do we need to check all three ways?

** Week 2
*** Reading and discussion
1. Vivaldi, Chapter 1
2. Primer, Fundamentals: Existential quantifiers, universal quantifiers, combining quantifiers
3. [[file:worksheet02.pdf][In class exercise 2]]

*** Writing
:PROPERTIES:
:EXPORT_FILE_NAME: writing02.pdf
:EXPORT_TITLE: Writing Assignment 2
:EXPORT_AUTHOR: MATH8705 The Language of Mathematics 2022
:EXPORT_OPTIONS: toc:nil ':t
:export_latex_header_extra: \input{macros}
:EXPORT_DATE: 
:END:
Vivaldi, Chapter 1, Exercise 1.2.
*** Presentation
**** Define an even number and prove that 0 is even.
**** Define a prime number and prove that 2 is the only even prime number.

** Week 1
*** Reading and discussion
1. Primer, Fundamentals: Set Theory, Functions (part one)
2. Vivaldi, Chapter 2
3. [[https://people.math.wisc.edu/~ellenber/mntcg/TalkTipSheet.pdf][Tips on giving talks, Jordan Ellenberg]]
4. [[file:worksheet01.pdf][In class exercise 1]]
*** Writing
1. Convert a page of handwritten mathematics into LaTeX.
*** Resources
- [[https://www.overleaf.com/learn/latex/Learn_LaTeX_in_30_minutes][Learn LaTeX in 30 minutes]]
- https://www.learnlatex.org/ (especially, lesson 10)
* Comments on presentations (updating list)
Many of these comments also apply to clear writing.
** General
1. Make eye contact with the audience as much as possible.  Avoid speaking to the board.
2. Speak so that everyone can hear clearly (not too softly or too fast).
3. Begin informally, before going into technical details.
4. Motivate your topic.  Get the readers interested in what you are saying.
5. Keep the talk focused.  Do not try to do everything.
   Some strategies to keep focus: making simplifying assumptions, doing special cases, explaining by an example.
** Board/slides
1. Write the title.
2. Write legibly, clearly, in sufficiently big font.
3. Develop the habit of speaking when you writing, avoiding long silences.
4. Use the board to write the important points, not as a place for scratch work.
** Content
1. Illustrate definitions with examples and non-examples.  Comment on edge cases.
2. Give precise definitions.  If that is not possible, explicitly indicate what is left vague or undefined.
3. Mention each non-trivial mathematical result you use.  Indicate if it is easy or difficult.  Give proper attribution.
4. Take every opportunity to draw a picture.
5. Take every (reasonable) opportunity to tell a story.
** Notation
1. Use consistent notation, and alert the audience if notation changes.
** Handouts
1. Keep consistent with the talk.
2. Comment on everything that is in the handout.

* General comments on the first paper
** Introduction

The introduction to your paper must answer the following two questions
1. What is the paper about?
2. Why should the readers care?
Number (2) is harder to achieve and takes practice.
Number (1) is easier.
To achieve (1), your introduction should explain the main topic and the main results.
After reading the introduction, the reader should not be surprised by anything that comes later.

