teaching/2022_mathematical_writing/index.html
<div id="outline-container-org7cebec0" class="outline-3">
<h3 id="org7cebec0">Week 4</h3>
<div class="outline-text-3" id="text-org7cebec0">
</div>
<div id="outline-container-orgb312a7d" class="outline-4">
<h4 id="orgb312a7d">Reading and discussion</h4>
<div class="outline-text-4" id="text-orgb312a7d">
<ol class="org-ol">
<li>Primer, Proof Techniques: Uniqueness, Casework, Either/Or Max/Min</li>
<li>Vivaldi, Chapter 6</li>
<li>Vivaldi, Sections 7.7, 7.8</li>
<li><a href="worksheet04.pdf">In class exercise 4</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgac4275e" class="outline-4">
<h4 id="orgac4275e">Writing</h4>
<div class="outline-text-4" id="text-orgac4275e">
<div class="properties" id="org1b2093c">

</div>

<ol class="org-ol">
<li>Vivaldi, Chapter 7, Exercise 7.1 (any 2)</li>
<li>Vivaldi, Chapter 7, Exercise 7.4 (any 5)</li>
</ol>
</div>
</div>
<div id="outline-container-org0fb5f3f" class="outline-4">
<h4 id="org0fb5f3f">Presentation</h4>
<div class="outline-text-4" id="text-org0fb5f3f">
</div>
<ul class="org-ul">
<li><a id="orgbf0c1ae"></a>Define the limit of a sequence.<br /></li>
<li><a id="orgd78ab3c"></a>Explain the quadratic formula.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8e2731f" class="outline-3">
<h3 id="org8e2731f">Week 3</h3>
<div class="outline-text-3" id="text-org8e2731f">
</div>
<div id="outline-container-org25fcda4" class="outline-4">
<h4 id="org25fcda4">Reading and discussion</h4>
<div class="outline-text-4" id="text-org25fcda4">
<ol class="org-ol">
<li>Primer, Functions (part two), negating universal quantifiers, negating existential quantifiers, negating nested quantifiers</li>
<li>Vivaldi, Chapter 4</li>
<li>Vivaldi, Chapter 5</li>
<li><a href="worksheet03.pdf">In class exercise 3</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgab5fba6" class="outline-4">
<h4 id="orgab5fba6">Writing</h4>
<div class="outline-text-4" id="text-orgab5fba6">
<div class="properties" id="org3181dd6">

</div>

<ol class="org-ol">
<li>Vivaldi, Chapter 4, Exercise 4.3 (any 10)</li>
<li>Vivaldi, Chapter 4, Exercise 4.4 (Only state the negations for any 5)</li>
<li>Vivaldi, Chapter 5, Exercise 5.1</li>
</ol>
</div>
</div>
<div id="outline-container-org682015e" class="outline-4">
<h4 id="org682015e">Presentation</h4>
<div class="outline-text-4" id="text-org682015e">
</div>
<ul class="org-ul">
<li><a id="orgbc88763"></a>Define a polynomial function and give some examples.<br /></li>
<li><a id="org7738940"></a>Define similar triangles.  Define equilateral triangles.  Prove that any two equilateral triangles are similar.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org5c494af" class="outline-3">
<h3 id="org5c494af">Week 2</h3>
<div class="outline-text-3" id="text-org5c494af">
</div>
<div id="outline-container-org852698b" class="outline-4">
<h4 id="org852698b">Reading and discussion</h4>
<div class="outline-text-4" id="text-org852698b">
<ol class="org-ol">
<li>Vivaldi, Chapter 1</li>
<li>Primer, Fundamentals: Existential quantifiers, universal quantifiers, combining quantifiers</li>
<li><a href="worksheet02.pdf">In class exercise 2</a></li>
</ol>
</div>
</div>
<div id="outline-container-org11b98a8" class="outline-4">
<h4 id="org11b98a8">Writing</h4>
<div class="outline-text-4" id="text-org11b98a8">
<div class="properties" id="org64fb4d0">

</div>

<p>
Vivaldi, Chapter 1, Exercise 1.2.
</p>
</div>
</div>
<div id="outline-container-org2686338" class="outline-4">
<h4 id="org2686338">Presentation</h4>
<div class="outline-text-4" id="text-org2686338">
</div>
<ul class="org-ul">
<li><a id="org6cf06bf"></a>Define an even number and prove that 0 is even.<br /></li>
<li><a id="orgfa72ebb"></a>Define a prime number and prove that 2 is the only even prime number.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org3abf87e" class="outline-3">
<h3 id="org3abf87e">Week 1</h3>
<div class="outline-text-3" id="text-org3abf87e">
</div>
<div id="outline-container-org6535935" class="outline-4">
<h4 id="org6535935">Reading and discussion</h4>
<div class="outline-text-4" id="text-org6535935">
<ol class="org-ol">
<li>Primer, Fundamentals: Set Theory, Functions (part one)</li>
<li>Vivaldi, Chapter 2</li>
<li><a href="https://people.math.wisc.edu/~ellenber/mntcg/TalkTipSheet.pdf">Tips on giving talks, Jordan Ellenberg</a></li>
<li><a href="worksheet01.pdf">In class exercise 1</a></li>
</ol>
</div>
</div>
<div id="outline-container-org3753ff3" class="outline-4">
<h4 id="org3753ff3">Writing</h4>
<div class="outline-text-4" id="text-org3753ff3">
<ol class="org-ol">
<li>Convert a page of handwritten mathematics into LaTeX.</li>
</ol>
</div>
</div>
<div id="outline-container-org0b45cd8" class="outline-4">
<h4 id="org0b45cd8">Resources</h4>
<div class="outline-text-4" id="text-org0b45cd8">
<ul class="org-ul">
<li><a href="https://www.overleaf.com/learn/latex/Learn_LaTeX_in_30_minutes">Learn LaTeX in 30 minutes</a></li>
<li><a href="https://www.learnlatex.org/">https://www.learnlatex.org/</a> (especially, lesson 10)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org87abfe9" class="outline-2">
<h2 id="org87abfe9">Comments on presentations (updating list)</h2>
<div class="outline-text-2" id="text-org87abfe9">
<p>
Many of these comments also apply to clear writing.
</p>
</div>
<div id="outline-container-org2a79d8e" class="outline-3">
<h3 id="org2a79d8e">General</h3>
<div class="outline-text-3" id="text-org2a79d8e">
<ol class="org-ol">
<li>Make eye contact with the audience as much as possible.  Avoid speaking to the board.</li>
<li>Speak so that everyone can hear clearly (not too softly or too fast).</li>
<li>Begin informally, before going into technical details.</li>
<li>Motivate your topic.  Get the readers interested in what you are saying.</li>
<li>Keep the talk focused.  Do not try to do everything.
Some strategies to keep focus: making simplifying assumptions, doing special cases, explaining by an example.</li>
</ol>
</div>
</div>
<div id="outline-container-org25024fa" class="outline-3">
<h3 id="org25024fa">Board/slides</h3>
<div class="outline-text-3" id="text-org25024fa">
<ol class="org-ol">
<li>Write the title.</li>
<li>Write legibly, clearly, in sufficiently big font.</li>
<li>Develop the habit of speaking when you writing, avoiding long silences.</li>
<li>Use the board to write the important points, not as a place for scratch work.</li>
</ol>
</div>
</div>
<div id="outline-container-org05fcb41" class="outline-3">
<h3 id="org05fcb41">Content</h3>
<div class="outline-text-3" id="text-org05fcb41">
<ol class="org-ol">
<li>Illustrate definitions with examples and non-examples.  Comment on edge cases.</li>
<li>Give precise definitions.  If that is not possible, explicitly indicate what is left vague or undefined.</li>
<li>Mention each non-trivial mathematical result you use.  Indicate if it is easy or difficult.  Give proper attribution.</li>
<li>Take every opportunity to draw a picture.</li>
<li>Take every (reasonable) opportunity to tell a story.</li>
</ol>
</div>
</div>
<div id="outline-container-org3c4d640" class="outline-3">
<h3 id="org3c4d640">Notation</h3>
<div class="outline-text-3" id="text-org3c4d640">
<ol class="org-ol">
<li>Use consistent notation, and alert the audience if notation changes.</li>
</ol>
</div>
</div>
<div id="outline-container-org6a16784" class="outline-3">
<h3 id="org6a16784">Handouts</h3>
<div class="outline-text-3" id="text-org6a16784">
<ol class="org-ol">
<li>Keep consistent with the talk.</li>
<li>Comment on everything that is in the handout.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org3c87594" class="outline-2">
<h2 id="org3c87594">General comments on the first paper</h2>
<div class="outline-text-2" id="text-org3c87594">
</div>
<div id="outline-container-orgdaa9229" class="outline-3">
<h3 id="orgdaa9229">Introduction</h3>
<div class="outline-text-3" id="text-orgdaa9229">
<p>
The introduction to your paper must answer the following two questions
</p>
<ol class="org-ol">
<li>What is the paper about?</li>
<li>Why should the readers care?</li>
</ol>
<p>
Number (2) is harder to achieve and takes practice.
Number (1) is easier.
To achieve (1), your introduction should explain the main topic and the main results.
After reading the introduction, the reader should not be surprised by anything that comes later.
</p>
</div>
</div>
