content/teaching/2022_mathematical_writing/index.org
** Body
Use the appropriate LaTeX environments for definitions, theorems etc.  
For example, put the theorems in \begin{theorem} ... \end{theorem} and the proofs in \begin{proof}...\end{proof}.

The body must be more than just a sequence of definitions and theorems. 
You must provide guides to the reader, by periodically reminding them what has been done and what comes ahead.
You can do this by including sentences like:
- Having defined eigenvectors and eigenvalues, we now see how to compute them.
- We are now ready to state the main theorem.
- Before we state the main theorem, we need some notation.
- We have finished proving the lemma; now we turn to the proof of the theorem.

All major definitions and theorems should come with an introductory sentence.

For example, before you state a theorem in \begin{theorem}...\end{theorem}, include a sentence like:
- The following is the main theorem of the paper.
- Having established the notation, we state the main theorem.
- The following theorem states that solutions exist and are unique.

Before you give a major definition in \begin{definition}...\end{definition}, include a sentence like:
- We now give the precise definition.
- The following is the key definition of the paper.

Before an example, include a sentence that explains why you are including the example.
For example:
- The following example shows that the solution is not always unique.
- We now give an example of a continuous function that is not differentiable.
- Not all matrices admit an eigenvector, as the following example shows.

An introductory sentence is also helpful for minor definitions and theorems, but in those cases, it is more acceptable to skip.

* Topics for second talk and paper
:PROPERTIES:
:EXPORT_OPTIONS: toc:nil ':t author:nil date:nil
:export_latex_header_extra: \input{macros}
:EXPORT_FILE_NAME: topics.pdf
:END:
1. Fermat's little theorem
2. The chromatic polynomial of a graph
3. The four colour theorem
4. Modelling radioactive decay
5. The mathematics of contagious diseases
6. Linear differential equations
7. Euler's method for numerically solving an ODE
8. The mathematics of carbon dating
9. The heat equation
10. The wave equation
11. Harmonic functions and the maximum principle
12. Primality testing
13. The RSA cryptosystem
14. The conjugate gradient method
15. The Poisson distribution
16. The binomial distribution
17. The central limit theorem
18. The maximum likelihood method
19. Primitive roots in modular arithmetic
20. Planar graphs
21. Recurrence relations
22. Exact differential equations
23. The prime number theorem
24. Taylor Series
25. Continued fractions
26. Any other topic (with my permission)

** Schedule for the second talk                                    :noexport:
- Week 9 (Tuesday)
  1. Buda Wu
  2. Weihua Shan
  3. Yi Zhuang
- Week 9 (Thursday)
  1. Xiaoxuan Wei
- Week 10 (Tuesday)
  1. Zhining Wang
  2. Han Lin
  3. Jingning Yao
- Week 11 (Tuesday)
  1. Zihan Zhao
  2. Fengyawen Li
  3. Chuqiao Xu
- Week 12 (Tuesday)
  1. Kristan Zhamy Octavianus
  2. Tongjia Hu
  3. Adam Goodge


* Judgement criteria for the papers
- *The title*                                                
  - /is descriptive./
  - /is concise./
- *The abstract*                                             
  - /adequately conveys the main topic./
  - /is concise./
- *The introduction*                                         
  - /motivates the topic./
  - /summarises all the key results./
  - /gives an outline of the rest of the paper./
  - /is not overly technical or overly vague./
- *The sections*                                             
  - /are titled informatively./
  - /are arranged in a logical order./
  - /are of appropriate length./
- *Theorems and definitions*                                 
  - /are in the correct environment./
  - /are stated precisely./
  - /are stated concisely./
  - /are motivated./
- *Proofs*                                                   
  - /are in the correct environment./
  - /are correct./
  - /are readable (not overly long or short)./
- *Surrounding discussion*                                   
  - /guides the reader by periodic recaping and fore-shadowing./
- *Language and grammar*                                     
  - /Everything is a part of a complete sentence./
  - /Spelling, grammar, and punctuation are correct./
  - /Sentences are not overly long./
  - /Writing is organised in logical paragraphs./
- *Mathematical matters*                                     
  - /Sentences do not start with a mathematical symbol./
  - /Mathematical expressions are adequately separated./
  - /Notation is not too cumbersome./
  - /Notation is consistent./
  - /Mathematical terms are used precisely./
- *References*                                               
  - /Proper citations are given./
  - /A list of references is included in a consistent format./
