teaching/2022_mathematical_writing/index.html
<div id="outline-container-orgd8b36f5" class="outline-3">
<h3 id="orgd8b36f5">Body</h3>
<div class="outline-text-3" id="text-orgd8b36f5">
<p>
Use the appropriate LaTeX environments for definitions, theorems etc.  
For example, put the theorems in <code>\begin{theorem} ... \end{theorem}</code> and the proofs in <code>\begin{proof}...\end{proof}</code>.
</p>

<p>
The body must be more than just a sequence of definitions and theorems. 
You must provide guides to the reader, by periodically reminding them what has been done and what comes ahead.
You can do this by including sentences like:
</p>
<ul class="org-ul">
<li>Having defined eigenvectors and eigenvalues, we now see how to compute them.</li>
<li>We are now ready to state the main theorem.</li>
<li>Before we state the main theorem, we need some notation.</li>
<li>We have finished proving the lemma; now we turn to the proof of the theorem.</li>
</ul>

<p>
All major definitions and theorems should come with an introductory sentence.
</p>

<p>
For example, before you state a theorem in <code>\begin{theorem}...\end{theorem}</code>, include a sentence like:
</p>
<ul class="org-ul">
<li>The following is the main theorem of the paper.</li>
<li>Having established the notation, we state the main theorem.</li>
<li>The following theorem states that solutions exist and are unique.</li>
</ul>

<p>
Before you give a major definition in <code>\begin{definition}...\end{definition}</code>, include a sentence like:
</p>
<ul class="org-ul">
<li>We now give the precise definition.</li>
<li>The following is the key definition of the paper.</li>
</ul>

<p>
Before an example, include a sentence that explains why you are including the example.
For example:
</p>
<ul class="org-ul">
<li>The following example shows that the solution is not always unique.</li>
<li>We now give an example of a continuous function that is not differentiable.</li>
<li>Not all matrices admit an eigenvector, as the following example shows.</li>
</ul>

<p>
An introductory sentence is also helpful for minor definitions and theorems, but in those cases, it is more acceptable to skip.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfbd6fba" class="outline-2">
<h2 id="orgfbd6fba">Topics for second talk and paper</h2>
<div class="outline-text-2" id="text-orgfbd6fba">
<div class="properties" id="orgc70d4f6">

</div>

<ol class="org-ol">
<li>Fermat&rsquo;s little theorem</li>
<li>The chromatic polynomial of a graph</li>
<li>The four colour theorem</li>
<li>Modelling radioactive decay</li>
<li>The mathematics of contagious diseases</li>
<li>Linear differential equations</li>
<li>Euler&rsquo;s method for numerically solving an ODE</li>
<li>The mathematics of carbon dating</li>
<li>The heat equation</li>
<li>The wave equation</li>
<li>Harmonic functions and the maximum principle</li>
<li>Primality testing</li>
<li>The RSA cryptosystem</li>
<li>The conjugate gradient method</li>
<li>The Poisson distribution</li>
<li>The binomial distribution</li>
<li>The central limit theorem</li>
<li>The maximum likelihood method</li>
<li>Primitive roots in modular arithmetic</li>
<li>Planar graphs</li>
<li>Recurrence relations</li>
<li>Exact differential equations</li>
<li>The prime number theorem</li>
<li>Taylor Series</li>
<li>Continued fractions</li>
<li>Any other topic (with my permission)</li>
</ol>
</div>
</div>
<div id="outline-container-orgfe6e01d" class="outline-2">
<h2 id="orgfe6e01d">Judgement criteria for the papers</h2>
<div class="outline-text-2" id="text-orgfe6e01d">
<ul class="org-ul">
<li><b>The title</b>                                                
<ul class="org-ul">
<li><i>is descriptive.</i></li>
<li><i>is concise.</i></li>
</ul></li>
<li><b>The abstract</b>                                             
<ul class="org-ul">
<li><i>adequately conveys the main topic.</i></li>
<li><i>is concise.</i></li>
</ul></li>
<li><b>The introduction</b>                                         
<ul class="org-ul">
<li><i>motivates the topic.</i></li>
<li><i>summarises all the key results.</i></li>
<li><i>gives an outline of the rest of the paper.</i></li>
<li><i>is not overly technical or overly vague.</i></li>
</ul></li>
<li><b>The sections</b>                                             
<ul class="org-ul">
<li><i>are titled informatively.</i></li>
<li><i>are arranged in a logical order.</i></li>
<li><i>are of appropriate length.</i></li>
</ul></li>
<li><b>Theorems and definitions</b>                                 
<ul class="org-ul">
<li><i>are in the correct environment.</i></li>
<li><i>are stated precisely.</i></li>
<li><i>are stated concisely.</i></li>
<li><i>are motivated.</i></li>
</ul></li>
<li><b>Proofs</b>                                                   
<ul class="org-ul">
<li><i>are in the correct environment.</i></li>
<li><i>are correct.</i></li>
<li><i>are readable (not overly long or short).</i></li>
</ul></li>
<li><b>Surrounding discussion</b>                                   
<ul class="org-ul">
<li><i>guides the reader by periodic recaping and fore-shadowing.</i></li>
</ul></li>
<li><b>Language and grammar</b>                                     
<ul class="org-ul">
<li><i>Everything is a part of a complete sentence.</i></li>
<li><i>Spelling, grammar, and punctuation are correct.</i></li>
<li><i>Sentences are not overly long.</i></li>
<li><i>Writing is organised in logical paragraphs.</i></li>
</ul></li>
<li><b>Mathematical matters</b>                                     
<ul class="org-ul">
<li><i>Sentences do not start with a mathematical symbol.</i></li>
<li><i>Mathematical expressions are adequately separated.</i></li>
<li><i>Notation is not too cumbersome.</i></li>
<li><i>Notation is consistent.</i></li>
<li><i>Mathematical terms are used precisely.</i></li>
</ul></li>
<li><b>References</b>                                               
<ul class="org-ul">
<li><i>Proper citations are given.</i></li>
<li><i>A list of references is included in a consistent format.</i></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org904bec0" class="outline-2">
<h2 id="org904bec0">What links here?</h2>
<div class="outline-text-2" id="text-org904bec0">
<ul class="org-ul">
<li><a href="../../index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
<li><a href="../../teaching.html#ID-3e570a8d-7ffa-4b1c-b8ac-c2077e6e894c">Mathematical writing, 2022</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by <a href="mailto:anand.deopurkar@anu.edu.au">Anand Deopurkar</a> using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11).  <a href="https://github.com/deopurkar/deopurkar.github.io">Last modified</a>: 2026-06-15 Mon 11:25.
</div>
</body>
</html>
